# 2
# https://dropmefiles.com/8GN3M

# 5
# https://dropmefiles.com/GrejH

# 14
# https://dropmefiles.com/R36qC

# 17
# В файле содержится последовательность из 10000 целых положительных чисел.
# Каждое число не превышает 10000.
# Определите и запишите в ответе сначала количество пар элементов последовательности,
# у которых сумма элементов кратна 10, затем максимальную из сумм элементов таких пар.
# В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.
# https://dropmefiles.com/Bg9w4