import time

# Функция print() - функция для вывода на экран
# Значок "#" служит для комментариев
# print("амогус", "Hello World!", "2 плюс 2 равно 4")
# print("я forget лол")
# print("паровозик томас")

# Математические выражения в функции print()
# print("Операция сложения:", 25 + 15)
# print("Операция разности:", 23 - 4)
# print("Операция умножения:", 45 * 1009)
# print("Операция деления:", 45 / 9, 11 / 2)
# print("Операция возведения в квадрат:", 12**2)

# Конкатенация - сложение строк
# print("Привет," + " меня зовут" + " Егор!", "Мне " + "11 лет!")
# print("Я " + "люблю " + "KFC")
# print("Моя " + "любимая" + " игра" + " GTA 5" + " и Roblox")


# Типы данных. Переменные. Тут пока что не задумываемся. Повторим на следующем уроке
# # Неизменяемые
# first = 100  # Первый неизменяемый тип - целочисленный тип.
# second = 2.5  # Второй неизменяемый тип - числа с плавающей точкой пулемёта типа генерала гарса хахахах.
# third = "Egor"  # Третий неизменяемый тип - строчки.
#
# # Изменяемые
# List = [11, 145, "Green", "KFC", "Roblox", "GTA V", "Minecraft", 64]  # Первый изменяемый тип - списки.
# # Нумерация идёт с нуля
# print("Цвет твоих глаз: " + List[2])
# print("Favorite Game(s): " + List[4] + ", " + List[5] + ", " + List[6])


# Форматированные строки. Используем форматированный вывод. Для примера раскоментируй строчки с 40 по 45
# name = "Egor"
# age = 11
# height = 145
# eyesColor = "green"
# schoolNumber = 618
# print(f"Hello! My name is {name}! I'm {age} years old. My eyes color is {eyesColor}. I study at the {schoolNumber} school!")

# name = "Arman"  Еще один пример форматированных строчек
# age = 17
# height = 178
# eyesColor = "black"
# schoolNumber = 91
# universityName = "ITMO University"
# print(f"Hello! My name is {eyesColor}! I'M {name.upper()}!!!!!! I'm {height} years old! My foot size is {age}! My sister is {schoolNumber} y.o. I study at {universityName}")


# Логические выражения в Python. Математические операции для сравнения чисел.
# print(3 > 1)
# print(3 >= 3)
# print(10 < 20)
# print(100 <= 200)
# print(10 == 10)
# print(5 != 3)


# Булевый тип - неизменяемый.
# Булевый тип - принимает только два значения: True или False.
# print("Истина", 3 > 1)
# print("Ложь", 1 > 10)
#
# print(8 < 4500000)  # Пример Истины
# print(7 > 999999999999999)  # Пример Лжи

# print(2.4999999999999999 > 2.4999999999999998)

# Ввод с клавиатуры
# Ввод с клавиатуры осуществляется с помощью функции input()
# a = input("Шпаргалка: введите крутость Егора -> ")
# print(f"{a} УРА!")

# Задание: описать человека
# name = str(input("Введите своё имя -> "))
# age = int(input("Введите свой возраст -> "))
# weight = float(input("Введите свой вес -> "))
# height = int(input("Введите свой рост -> "))
# IQ = int(input("Введите своё IQ -> "))
# print()
# print(f"Внимание! Обнаружен нарушитель! Имя: {name}! Возраст: {age}! Вес и Рост нарушителя составляет: {weight} и {height}! У нарушителя наблюдается низкий уровень интеллекта: IQ = {IQ}")

#
# # Функция print() - функция для вывода на экран
# # Значок "#" служит для комментариев
# ### ПЕРВАЯ ПРОГРАММА С ЕГОРОМ! УУРА!!!
# # print("амогус", "Hello World!", "2 плюс 2 равно 4")
# ### ПЕРВАЯ ПРОГРАММА С ЕГОРОМ! УУРА!!!
# # print("я forget лол")
# # print("паровозик томас")
#
# # Математические выражения в функции print()
# # print("Операция сложения:", 25 + 15)
# # print("Операция разности:", 23 - 4)
# # print("Операция умножения:", 45 * 1009)
# # print("Операция деления:", 45 / 9, 11 / 2)
# # print("Операция возведения в квадрат:", 12**2)
#
# # Конкатенация - сложение строк
# # print("Привет," + " меня зовут" + " Егор!", "Мне " + "11 лет!")
# # print("Я " + "люблю " + "KFC")
# # print("Моя " + "любимая" + " игра" + " GTA 5" + " и Roblox")
#
#
# # 18.09.2022 ВТОРОЙ УРОК С ЕГОРОМ УУРА!
#
# # Типы данных. Переменные. Тут пока что не задумываемся. Повторим на следующем уроке
# # # Неизменяемые
# # first = 100  # Первый неизменяемый тип - целочисленный тип int.
# # second = 2.5  # Второй неизменяемый тип - числа с плавающей точкой float.
# # third = "Egor"  # Третий неизменяемый тип - строчки str.
# #
# # # Изменяемые
# # List = [11, 145, "Green", "KFC", "Roblox", "GTA V", "Minecraft", 64]  # Первый изменяемый тип - списки list.
# # # Нумерация идёт с нуля
# # print("Цвет твоих глаз: " + List[2])
# # print("Favorite Game(s): " + List[4] + ", " + List[5] + ", " + List[6])
#
#
# # Форматированные строки. Используем форматированный вывод. Для примера раскоментируй строчки с 40 по 45
# # name = "Egor"
# # age = 11
# # height = 145
# # eyesColor = "green"
# # schoolNumber = 618
# # print(f"Hello! My name is {name}! I'm {age} years old. My eyes color is {eyesColor}. I study at the {schoolNumber} school!")
#
# # name = "Arman"  Еще один пример форматированных строчек
# # age = 17
# # height = 178
# # eyesColor = "black"
# # schoolNumber = 91
# # universityName = "ITMO University"
# # print(f"Hello! My name is {eyesColor}! I'M {name.upper()}!!!!!! I'm {height} years old! My foot size is {age}! My sister is {schoolNumber} y.o. I study at {universityName}")
#
#
# # Логические выражения в Python. Математические операции для сравнения чисел.
# # print(3 > 1)
# # print(3 >= 3)
# # print(10 < 20)
# # print(100 <= 200)
# # print(10 == 10)
# # print(5 != 3)
#
#
# # Булевый тип - неизменяемый.
# # Булевый тип - принимает только два значения: True или False.
# # print("Истина", 3 > 1)
# # print("Ложь", 1 > 10)
# #
# # print(8 < 4500000)  # Пример Истины
# # print(7 > 999999999999999)  # Пример Лжи
#
# # print(2.4999999999999999 > 2.4999999999999998)
#
# # Ввод с клавиатуры
# # Ввод с клавиатуры осуществляется с помощью функции input()
# # a = input("Шпаргалка: введите крутость Егора -> ")
# # print(f"{a} УРА!")
#
# # Задание: описать человека
# # name = str(input("Введите своё имя -> "))
# # age = int(input("Введите свой возраст -> "))
# # weight = float(input("Введите свой вес -> "))
# # height = int(input("Введите свой рост -> "))
# # IQ = int(input("Введите своё IQ -> "))
# # print()
# # print(f"Внимание! Обнаружен нарушитель! Имя: {name}! Возраст: {age}! Вес и Рост нарушителя составляет: {weight} и {height}! У нарушителя наблюдается низкий уровень интеллекта: IQ = {IQ}")
#
#
# # 02.10.2022
# # Условные конструкции. if/else/elif
# # if/else - основа условных конструкций
# # elif - подусловие
# # age = int(input())
# # height = int(input())
# # if age >= 18:  # начало условной конструкции. проверка логического выражения стоящего после if
# # 	print("Вход разрешен!")
# # elif height <= 150:  # подусловие. выполниться только если предыдущий if - Ложь
# # 	print("Вход запрещен вследствие низкого роста! У вас не получится дотянуться до некоторых кнопок на клавиатуре! "
# # 	      "Ливайте отседова!")
# # else:  # конец условной конструкции. выполниться тогда и только тогда, когда все предыдущие if/elif - Ложь
# # 	print("Вход запрещен! Вы еще не доросли! Ливайте отседова!")
#
#
# # Циклы. For loop and While loop
#
# # цикл while
# # while (логическое выражение)
# #   блок кода (который выполняеться до тех пор, пока лог. выражение истино)
# # while 1 == 1: ТАК ДЕЛАТЬ НЕЛЬЗЯ!!!
# # 	print("hello world!")
# # i = 1  # Переменная - счётчик
# # while i <= 10:
# # 	print(i, "Egor is cool!")
# # 	i = i + 1
#
# # цикл for
# # for (переменная-счетчик) in range(число повторений блока кода):
# #   блок кода
# # range(start, stop, step)
#
#
# # for i in range(101):
# 	# print(i, "Egor the best!")
#
# # s = 1
# # for i in range(1, 100):
# # 	s = s * i
# # print(s)
# # Эродяка Бородяка изыди из моей комнаты ауауахуа!

# s = 0
# for i in range(100):
# 	s = s + i
# print(s)

# for i in range(1, 10, 2):
# 	print(i)

# a = 1024
# b = 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2
# c = 2**10
# print(a == b == c)
# for i in range(10):
# 	a = a / 2
# 	print(i + 1, a)
#
#
# i = 0
# while i <= 100:
# 	print(f"Взлом системы: {i}%")
# 	i = i + 1


# bool интерпретация чисел
# 1 - истина (True)
# 0 - ложь (False)

# EgorPreparedForGeography = bool(int(input()))
# if EgorPreparedForGeography:
# 	print("Садись, пять! Молодец!")
# else:
# 	print("Садись, два! Подготовься к следующему занятию!")


# Работа со списками с помощью цикла for
# arr = [1, 2, "Hello World", True, [1, 2, "Egor"]]
# len(список) - длина списка (количество элементов)
# print("Длина списка arr: " + str(len(arr)))
# for i in range(len(arr)):
# print(f"Номер элемента: {i + 1}. Элемент: {arr[i]}")


# arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# for i in range(len(arr)):
# 	print(f"Число: {arr[i]} => Квадрат числа: {arr[i]**2}")
# 	print(f"Число: {arr[i]} => Куб числа: {arr[i]**3}")
# 	print()


# 23.10.2022
# arr = [1, 1, 1, 1, 1, 1, 1, 1]
# print(f"Старый список: \n{arr}")
# for i in range(len(arr)):
# 	arr[i] = arr[i] + 1
#
# print(f"Новый список: \n{arr}")
#
# for i in "Roblox & Minecraft":
# 	arr.append(i)
# print(f"Список с Егором: \n{arr}")


# favourite_game = str(input())
# if favourite_game.lower() == "minecraft":
# 	print("Тебе нужно войти! Тебе обязательно тут понравится!")
# else:
# 	print("Иди гуляй! Для тебя тут ничего интересного не будет!")


# arr = [1, 1.10, "Egor", True, ["Hello World!", "Minecraft!"]]
# help(arr)  # help(название переменной) => выведется на экран все методы и функции, применимые к этой переменной
# type(название переменной) => возвращает тип конкретной переменной
# for i in range(len(arr)):
# print(arr[i], type(arr[i]))


# 06.11.2022
# Тема урока: Функции
# Области видимости
# 2 вида: глобальная (всеобщая, т.е большая или ВСЯ) и локальная (местная, т.е маленькое)

# Вот этот код - находится в глобальной области видимости (Весь земной шар)
# # Это глобальная область видимости - так как данный код не внутри функции
# array = [1, 2, 3, 4, "Hello world", "Hello Egor!", [True, False, "йоу"], "всем привет!"]
# print("Egor the coolest")
# print("Today is the 6th of November")
# for i in range(len(array)):
# 	print(array[i])
#
#
# # Пример локальной области видимости (Конкретная страна)
# # То что происходит в конкретной стране, остается внутри неё
# # Ключевое слово def - происходит от define (с англ. определить, объявить).
# # Оно объявляет функцию в локальной области видимости
#
# # Синтаксис объявления функции
# # def название_функции():
# #       блок_кода
# #       return что-то
#
# def function():
# 	return "Hello world!"
#
#
# def Egypt(temperature):
# 	return f"Завтра в Египте температура составит: {temperature} градусов по Цельсию"
#
#
# print(Egypt(100))
# print(function())

# Practice
# arr1 = [1, 2, 3, 4, 5, "Egor"]
# arr2 = [10, 20, 30, 40, 100]
#
#
# def double(array):
# 	for i in range(len(array)):
# 		array[i] = array[i] * 2
# 	return array
#
#
# def triple(array):
# 	for i in range(len(array)):
# 		array[i] = array[i] * 3
# 	return array
#
#
# print(triple(arr1))
