# Выполняем вторые номера ЕГЭ! Закрепляем материал
# Если вы бля мне будете кидать задания: текстом, разными файлами и тд. Я их проверять не буду!!!
# Сделали одно задание, проверили, закомментировали и переходим к следующему
# После того как все задания сделаны, закомментируйте все задания
# Комментировать можно с помощью комбинации клавиш Ctrl + / (Windows) или Cmd + / (Mac)
# Для запуска программы нажмите Ctrl + F5 (Windows) или Cmd + F5 (Mac)
# В случае если что-то не работает, обращайтесь ко мне
# Если вы не знаете как сделать задание, то пишите мне в личку

# Задание 1
# №14688 (№2 в ЕГЭ)

# Задание 2
# №15097 (№2 в ЕГЭ)

# Задание 3
# №15814 (№2 в ЕГЭ)

# Задание 4
# №27535 (№5 в ЕГЭ) (простое)
# Подсказка: используйте цикл for для перебора N. Строки индексируются с 0, и к ним можно обращаться по индексу как к списку


# Удачи! Если что-то не понятно, пишите в личку
