# Салам бездари! Рад вас снова тут видеть!
# * Сегодня решаем 17-ые задачи и extra задачу на умение гуглить!
# * Extra задача не является обязательной к выполнению, но по мне она крайне интересная и советую вам посидеть над ней
# * Если возникнут затруднения, обращайтесь за подсказкой
#
# Также хочу вас обрадовать, что эта домашка станет нашей отправной точкой в мир GitHub!
# * Отныне, начиная с этого задания, решения ДЗ вы будете "пушить" в наш репозиторий
# * Подробная инструкция, будет чуть позже выложена в общий чат
# * По всем вопросам касательно работы с GitHub обращайтесь ко мне или гуглите)
# ** Всех обнял! **
#
# Доп. инстуркция к выполнению этой домашки.
# * Все текстовые файлы прошу называть номером задачи из РешуЕГЭ.
# * Переделайте свою папку так, чтобы в ней было легко разобраться, -
# - и нельзя было потеряться среди файлов домашек и файлов требуемых к выполнению задания
#
#
# 1 задание
# 39763
#
# 2 задание
# 37344
#
# 3 задание
# 37354
#
# 4 задание
# 47221
#
# Extra задание
# Задание: Shoes
# Вам дана картинка по ссылке из файлообменика. Будьте добры, дать ответ на вопрос =>
# Что за кроссовки на нём надеты? В ответе нужно указать артикул товара согласно используемой производителем номенклатуре.
# https://dropmefiles.com/EYbZC