# Всем привет! Домашка 5!
# Будем решать 14 номера из ЕГЭ по информатике
# Также дам несколько задач потренироваться в написании функций и лямбда-функций
# И в конце две Extra задачи, на умение гуглить. На занятии я уже дал несколько подсказок по ним

# Задание 1
# 48339

# Задание 2
# 48382

# Задание 3
# 7761

# Задание 4
# 17334

# Блок Функции и лямбда-функции

# Задание 1
# Напишите функцию, которая принимает на вход два числа и возвращает:
# сумму, произведение, разность, частное, максимальное, минимальное из них

# Задание 2
# Напишите лямбда-функцию, которая принимает на вход число и проверяет его четность

# Задание 3
# Попробуйте по памяти написать функцию calc(x, a, b)
# Сделайте форматный вывод по типу: "x = 123, a = 10, b = 7, result = 123"

# Задание 4
# Напишите функцию, которая принимает на вход число и возвращает его факториал
# Без использования math.factorial!

# Блок Extra задач
# Задание 1
# Вам дана фотография ноутбука. Ответьте на следуюший вопрос:
# С каким моментом затянут каждый из самых туго затянутых винтов в этом компьютере? Ответ следует выразить в ньютон-метрах.
# https://dropmefiles.com/kYUbB
#
# Задание 2
# Вам дана фотография улицы. Ответьте на следуюший вопрос:
# Какие два слова висели 26 лет назад на месте этих следов от логотипа Открытия?
# https://dropmefiles.com/yZcGI